Last login: Sun Jul 28 16:27:07 on ttys000
Clares-MacBook-Pro:~ clarekirkland$ cd Documents/Clemson/3520-ProgrammingSystems/SDEs/Two-July29
Clares-MacBook-Pro:Two-July29 clarekirkland$ swipl
Welcome to SWI-Prolog (threaded, 64 bits, version 8.0.3)
SWI-Prolog comes with ABSOLUTELY NO WARRANTY. This is free software.
Please run ?- license. for legal details.

For online help and background, visit http://www.swi-prolog.org
For built-in help, use ?- help(Topic). or ?- apropos(Word).

?- ['nnr1.pro'].
true.

?- printList([[5,5,1],[5,-5,2],[-5,-5,3],[-5,5,4]]).
[5,5,1]
[5,-5,2]
[-5,-5,3]
[-5,5,4]
true.

?- printList([
|    [3.26495e+02, 6.00000e+00, 2.82447e+02, 1.10000e+01, -3.61804e+01, -1.17557e+01, 1],
|    [5.19186e+02, 1.00000e+00, 4.57228e+01, 4.70000e+01, -3.61804e+01, -1.17557e+01, 1],
|    [7.03244e+01, 5.00000e+00, 2.15593e+01, 2.80000e+01, -2.23607e+01, 3.07768e+01, 1],
|    [1.87247e+02, 1.00000e+00, 7.03097e+01, 1.80000e+01, -2.23607e+01, 3.07768e+01, 1],
|    [4.26179e+02, 6.00000e+00, 1.33301e+02, 2.20000e+01, 3.61804e+01, 1.17557e+01, 7],
|    [1.97036e+03, 5.00000e+00, 7.51209e+02, 1.90000e+01, 3.11803e+01, 1.90212e+01, 7],
|    [1.28191e+03, 1.00000e+00, 6.08078e+02, 2.20000e+01, 1.78214e+01, 1.08487e+01, 7],
|    [4.82068e+02, 4.00000e+00, 4.71010e+02, 2.00000e+01, -2.23607e+01, 3.07768e+01, 1],
|    [9.24921e+02, 7.00000e+00, 3.40959e+02, 1.60000e+01, 3.61804e+01, 1.17557e+01, 1],
|    [4.85993e+02, 7.00000e+00, 3.91866e+02, 2.10000e+01, -2.23607e+01, 3.07768e+01, 1],
|    [1.85204e+02, 4.00000e+00, 5.22527e+01, 2.40000e+01, -2.23607e+01, 3.07768e+01, 5],
|    [2.54153e+02, 2.40000e+01, 1.86337e+02, 1.00000e+00, 1.40018e+01, 2.98699e+01, 5],
|    [3.08718e+02, 1.00000e+01, 1.56700e+02, 2.00000e+01, -2.23607e+01, -3.07768e+01, 5],
|    [1.28083e+02, 8.00000e+00, 1.33937e+01, 5.40000e+01, 0.00000e+00, -1.00000e+01, 4],
|    [1.44025e+02, 6.00000e+00, 2.34110e+01, 1.60000e+01, -2.23607e+01, 3.07768e+01, 4],
|    [1.90704e+02, 6.00000e+00, 2.35136e+01, 1.80000e+01, 1.40018e+01, -2.98699e+01, 4],
|    [1.74306e+02, 1.20000e+01, 5.55195e+01, 2.20000e+01, -1.40018e+01, -2.98699e+01, 5],
|    [2.01648e+02, 1.00000e+00, 1.35576e+02, 4.90000e+01, 3.61804e+01, -1.17557e+01, 5],
|    [5.38501e+01, 6.00000e+00, 4.88364e+01, 2.50000e+01, 0.00000e+00, -1.00000e+01, 5],
|    [1.50294e+02, 7.00000e+00, 2.42179e+01, 2.40000e+01, 0.00000e+00, -1.00000e+01, 5]]).
[326.495,6.0,282.447,11.0,-36.1804,-11.7557,1]
[519.186,1.0,45.7228,47.0,-36.1804,-11.7557,1]
[70.3244,5.0,21.5593,28.0,-22.3607,30.7768,1]
[187.247,1.0,70.3097,18.0,-22.3607,30.7768,1]
[426.179,6.0,133.301,22.0,36.1804,11.7557,7]
[1970.36,5.0,751.209,19.0,31.1803,19.0212,7]
[1281.91,1.0,608.078,22.0,17.8214,10.8487,7]
[482.068,4.0,471.01,20.0,-22.3607,30.7768,1]
[924.921,7.0,340.959,16.0,36.1804,11.7557,1]
[485.993,7.0,391.866,21.0,-22.3607,30.7768,1]
[185.204,4.0,52.2527,24.0,-22.3607,30.7768,5]
[254.153,24.0,186.337,1.0,14.0018,29.8699,5]
[308.718,10.0,156.7,20.0,-22.3607,-30.7768,5]
[128.083,8.0,13.3937,54.0,0.0,-10.0,4]
[144.025,6.0,23.411,16.0,-22.3607,30.7768,4]
[190.704,6.0,23.5136,18.0,14.0018,-29.8699,4]
[174.306,12.0,55.5195,22.0,-14.0018,-29.8699,5]
[201.648,1.0,135.576,49.0,36.1804,-11.7557,5]
[53.8501,6.0,48.8364,25.0,0.0,-10.0,5]
[150.294,7.0,24.2179,24.0,0.0,-10.0,5]
true.

?- theClass([3,3,0],What).
What = 0.

?- theClass([8,7,6,5],Class).
Class = 5.

?- distanceR2([3,3,0],[-1,-1,0],What).
What = 32.0.

?- distanceR2([98.641683, 17.0, 75.387416, 9.0, -36.18035, 11.7557, 0],[1869.2331, 5.0, 184.885, 27.0, 17.82145, 10.8487, 0],What).
What = 3150368.703908144.

?- distanceAllVectors2([3,3,0],[[5,5,1],[5,-5,2],[-5,-5,3],[-5,5,4]],What).
What = [8.0, 68.0, 128.0, 68.0].

?- distanceAllVectors2([98.641683, 17.0, 75.387416, 9.0, -36.18035, 11.7557, 0],[
|    [3.26495e+02, 6.00000e+00, 2.82447e+02, 1.10000e+01, -3.61804e+01, -1.17557e+01, 1],
|    [5.19186e+02, 1.00000e+00, 4.57228e+01, 4.70000e+01, -3.61804e+01, -1.17557e+01, 1],
|    [7.03244e+01, 5.00000e+00, 2.15593e+01, 2.80000e+01, -2.23607e+01, 3.07768e+01, 1],
|    [1.87247e+02, 1.00000e+00, 7.03097e+01, 1.80000e+01, -2.23607e+01, 3.07768e+01, 1],
|    [4.26179e+02, 6.00000e+00, 1.33301e+02, 2.20000e+01, 3.61804e+01, 1.17557e+01, 7],
|    [1.97036e+03, 5.00000e+00, 7.51209e+02, 1.90000e+01, 3.11803e+01, 1.90212e+01, 7],
|    [1.28191e+03, 1.00000e+00, 6.08078e+02, 2.20000e+01, 1.78214e+01, 1.08487e+01, 7],
|    [4.82068e+02, 4.00000e+00, 4.71010e+02, 2.00000e+01, -2.23607e+01, 3.07768e+01, 1],
|    [9.24921e+02, 7.00000e+00, 3.40959e+02, 1.60000e+01, 3.61804e+01, 1.17557e+01, 1],
|    [4.85993e+02, 7.00000e+00, 3.91866e+02, 2.10000e+01, -2.23607e+01, 3.07768e+01, 1],
|    [1.85204e+02, 4.00000e+00, 5.22527e+01, 2.40000e+01, -2.23607e+01, 3.07768e+01, 5],
|    [2.54153e+02, 2.40000e+01, 1.86337e+02, 1.00000e+00, 1.40018e+01, 2.98699e+01, 5],
|    [3.08718e+02, 1.00000e+01, 1.56700e+02, 2.00000e+01, -2.23607e+01, -3.07768e+01, 5],
|    [1.28083e+02, 8.00000e+00, 1.33937e+01, 5.40000e+01, 0.00000e+00, -1.00000e+01, 4],
|    [1.44025e+02, 6.00000e+00, 2.34110e+01, 1.60000e+01, -2.23607e+01, 3.07768e+01, 4],
|    [1.90704e+02, 6.00000e+00, 2.35136e+01, 1.80000e+01, 1.40018e+01, -2.98699e+01, 4],
|    [1.74306e+02, 1.20000e+01, 5.55195e+01, 2.20000e+01, -1.40018e+01, -2.98699e+01, 5],
|    [2.01648e+02, 1.00000e+00, 1.35576e+02, 4.90000e+01, 3.61804e+01, -1.17557e+01, 5],
|    [5.38501e+01, 6.00000e+00, 4.88364e+01, 2.50000e+01, 0.00000e+00, -1.00000e+01, 5],
|    [1.50294e+02, 7.00000e+00, 2.42179e+01, 2.40000e+01, 0.00000e+00, -1.00000e+01, 5]],What).
What = [95468.59132411805, 179990.2979333865, 4757.119559944045, 8766.470371779647, 116160.75537984603, 3964898.516252253, 1687225.179950336, 304375.754510354, 758650.854070818|...].

?- nnr1([-1,1,0],[[5,5,1],[5,-5,2],[-5,-5,3],[-5,5,4]],What).
What = 4.

?- nnr1([98.641683, 17.0, 75.387416, 9.0, -36.18035, 11.7557, 0],[
|    [3.26495e+02, 6.00000e+00, 2.82447e+02, 1.10000e+01, -3.61804e+01, -1.17557e+01, 1],
|    [5.19186e+02, 1.00000e+00, 4.57228e+01, 4.70000e+01, -3.61804e+01, -1.17557e+01, 1],
|    [7.03244e+01, 5.00000e+00, 2.15593e+01, 2.80000e+01, -2.23607e+01, 3.07768e+01, 1],
|    [1.87247e+02, 1.00000e+00, 7.03097e+01, 1.80000e+01, -2.23607e+01, 3.07768e+01, 1],
|    [4.26179e+02, 6.00000e+00, 1.33301e+02, 2.20000e+01, 3.61804e+01, 1.17557e+01, 7],
|    [1.97036e+03, 5.00000e+00, 7.51209e+02, 1.90000e+01, 3.11803e+01, 1.90212e+01, 7],
|    [1.28191e+03, 1.00000e+00, 6.08078e+02, 2.20000e+01, 1.78214e+01, 1.08487e+01, 7],
|    [4.82068e+02, 4.00000e+00, 4.71010e+02, 2.00000e+01, -2.23607e+01, 3.07768e+01, 1],
|    [9.24921e+02, 7.00000e+00, 3.40959e+02, 1.60000e+01, 3.61804e+01, 1.17557e+01, 1],
|    [4.85993e+02, 7.00000e+00, 3.91866e+02, 2.10000e+01, -2.23607e+01, 3.07768e+01, 1],
|    [1.85204e+02, 4.00000e+00, 5.22527e+01, 2.40000e+01, -2.23607e+01, 3.07768e+01, 5],
|    [2.54153e+02, 2.40000e+01, 1.86337e+02, 1.00000e+00, 1.40018e+01, 2.98699e+01, 5],
|    [3.08718e+02, 1.00000e+01, 1.56700e+02, 2.00000e+01, -2.23607e+01, -3.07768e+01, 5],
|    [1.28083e+02, 8.00000e+00, 1.33937e+01, 5.40000e+01, 0.00000e+00, -1.00000e+01, 4],
|    [1.44025e+02, 6.00000e+00, 2.34110e+01, 1.60000e+01, -2.23607e+01, 3.07768e+01, 4],
|    [1.90704e+02, 6.00000e+00, 2.35136e+01, 1.80000e+01, 1.40018e+01, -2.98699e+01, 4],
|    [1.74306e+02, 1.20000e+01, 5.55195e+01, 2.20000e+01, -1.40018e+01, -2.98699e+01, 5],
|    [2.01648e+02, 1.00000e+00, 1.35576e+02, 4.90000e+01, 3.61804e+01, -1.17557e+01, 5],
|    [5.38501e+01, 6.00000e+00, 4.88364e+01, 2.50000e+01, 0.00000e+00, -1.00000e+01, 5],
|    [1.50294e+02, 7.00000e+00, 2.42179e+01, 2.40000e+01, 0.00000e+00, -1.00000e+01, 5]],What).
What = 1.

?- 
